БухЭксп/Reports/CW_РеализацияЗаПериод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_РеализацияЗаПериод</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/Enums/CW_НаправлениеСортировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_НаправлениеСортировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВозрастанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУбыванию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ПараметрыГрузоперевозок</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ЖелезнодорожныеСтанции</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СкладыВременногоХранения</v8:Type>
				<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_РазмерыКонтейнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Авиалинии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыКонтейнеров</v8:Type>
				<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДополнительныеЗначенияПараметровГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Аэропорты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактнаяИнформация</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>600</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыОтбораДляПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриИзменении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ДействияПриИзмененииКонтрольнойДаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйПересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПиктограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеУсловногоОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВводаАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВыбораОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаИспользуетВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПросрочкиКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественноеПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВФормеГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченСпискомЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрОтметкиУведомления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПолноеЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВедомыйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтрольнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСсылочныйТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧисло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПГ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыУсловийОтбораПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоступноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедущиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Reports/CW_РеализацияЗаПериод/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоВнешнийВызов = Ложь;
	Если Параметры.Свойство("ВнешнийВызов") Тогда
		ЭтоВнешнийВызов = Параметры.ВнешнийВызов;
	КонецЕсли;
	
	ИсключатьВнутрихолдинговыеВзаиморасчеты = CW_Настройки.ПолучитьНастройкуПользователя(,"ИсключатьВнутрихолдинговыеВзаиморасчеты");
	
	Если ЭтоВнешнийВызов Тогда
		СформироватьПриОткрытии = ЭтоВнешнийВызов;
		ЭтоВнешнийВызов 		= ложь;
		
		Если Параметры.Свойство("НачалоПериода") Тогда
			НачалоПериода = Параметры.НачалоПериода;
		КонецЕсли;
		Если Параметры.Свойство("КонецПериода") Тогда
			КонецПериода = Параметры.КонецПериода;
		КонецЕсли;
		Если Параметры.Свойство("ВариантПериодаОтчета") Тогда
			ВариантПериодаОтчета = Параметры.ВариантПериодаОтчета;
		КонецЕсли;
		Если Параметры.Свойство("ВариантФормирования") Тогда
			ВариантФормирования = Параметры.ВариантФормирования;
		КонецЕсли;
		Если Параметры.Свойство("ИсключатьВнутрихолдинговыеВзаиморасчеты") Тогда
			ИсключатьВнутрихолдинговыеВзаиморасчеты = Параметры.ИсключатьВнутрихолдинговыеВзаиморасчеты;
		КонецЕсли;
		Если Параметры.Свойство("ОбъединитьГруппировки") Тогда
			ОбъединитьГруппировки = Параметры.ОбъединитьГруппировки;
		КонецЕсли;
		Если Параметры.Свойство("ПорядокОтражения") Тогда
			ПорядокОтражения = Параметры.ПорядокОтражения;
		КонецЕсли;
		
        //Группировки
		Если Параметры.Свойство("Группировки") Тогда
			мГруппировки 		= Параметры.Группировки;
			Для Каждого ЭлементГруппировки из мГруппировки Цикл
				Нстр = Группировки.Добавить();
				Нстр.ИмяПоля = ЭлементГруппировки.Ключ;
				Нстр.Представление = ЭлементГруппировки.Значение;
				Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
			КонецЦикла;
		КонецЕсли;
		
		//отбор
		Если Параметры.Свойство("Отбор") Тогда
			Если Параметры.Свойство("Отбор") Тогда
				стрОтбор = Параметры.Отбор;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьСписокПоказателей();
		
	Иначе
		// группировки
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "Валюта";
		Нстр.Представление = "Валюта";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		// --- 
		Нстр = Группировки.Добавить();
		Нстр.ИмяПоля = "Контрагент";
		Нстр.Представление = "Контрагент";
		Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		
		_ВосстановитьСеансовуюНастройку();
		
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
	CW_ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	Если НЕ CW_ВалютаРегламентированногоУчетаРубль Тогда
		ВариантФормирования = 1;
	КонецЕсли;  
	
 	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если СформироватьПриОткрытии Тогда
		
		СформироватьПриОткрытии=Ложь;

		// ----
		Если ЗначениеЗаполнено(стрОтбор) Тогда
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
			
			КомпоновщикНастроекОтбор =  Отчет.КомпоновщикНастроек.Настройки.Отбор;
			Для Каждого ЭлементСтркутуры из стрОтбор Цикл				
				Если  ЗначениеЗаполнено(ЭлементСтркутуры.Значение) Тогда
					НовыйЭлементОтбора = КомпоновщикНастроекОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементСтркутуры.Ключ);
					НовыйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
					НовыйЭлементОтбора.Использование = Истина;
					Если ТипЗнч(ЭлементСтркутуры.Значение) = Тип("Массив") Тогда
						СписокЗначений = Новый СписокЗначений;
						СписокЗначений.ЗагрузитьЗначения(ЭлементСтркутуры.Значение);
						
						НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
						НовыйЭлементОтбора.ПравоеЗначение 	=  СписокЗначений;
						
					Иначе
						
						НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
						НовыйЭлементОтбора.ПравоеЗначение 	= ЭлементСтркутуры.Значение;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// ----
	
		СформироватьОтчет();
		_Настройка(Истина); 
	Иначе
		_ВосстановитьСтандартныеНастройки();
		_ВосстановитьСеансовуюНастройку();
	КонецЕсли; 
	
	// период по умолчанию
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;		
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	//БухгалтерскиеОтчетыКлиент
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	//---БухгалтерскиеОтчетыКлиент

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_РеализацияЗаПериод.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	// --- 
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			
			СеансоваяНастройка.Свойство("Показатели",Показатели);
			СеансоваяНастройка.Свойство("ВариантФормирования",ВариантФормирования);
			СеансоваяНастройка.Свойство("ПорядокОтражения",ПорядокОтражения);
			СеансоваяНастройка.Свойство("ОбъединитьГруппировки", ОбъединитьГруппировки);
			
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
	ЗаполнитьСписокПоказателей();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПоказателей()
	
	ВремСписок = Показатели.Скопировать();
	Показатели.Очистить();
	
	СтрокаПоказатлей = ВремСписок.НайтиПоЗначению("Количество");
	Пометка = ?(СтрокаПоказатлей = Неопределено, Истина, СтрокаПоказатлей.Пометка);
	Показатели.Добавить("Количество",	"Количество",	Пометка);
	
	СтрокаПоказатлей = ВремСписок.НайтиПоЗначению("Сумма");
	Пометка = ?(СтрокаПоказатлей = Неопределено, Истина, СтрокаПоказатлей.Пометка);
	Показатели.Добавить("Сумма",		"Сумма",		Пометка);
	
	СтрокаПоказатлей = ВремСписок.НайтиПоЗначению("НДС");
	Пометка = ?(СтрокаПоказатлей = Неопределено, Истина, СтрокаПоказатлей.Пометка);
	Показатели.Добавить("НДС",			"НДС",			Пометка);
	
	СтрокаПоказатлей = ВремСписок.НайтиПоЗначению("Всего");
	Пометка = ?(СтрокаПоказатлей = Неопределено, Истина, СтрокаПоказатлей.Пометка);
	Показатели.Добавить("Всего",		"Всего",		Пометка);
	
	СтрокаПоказатлей = ВремСписок.НайтиПоЗначению("Всего_Валюта");
	Пометка = ?(СтрокаПоказатлей = Неопределено, Истина, СтрокаПоказатлей.Пометка);
	Показатели.Добавить("Всего_Валюта",	"Всего, Вал.",	Пометка);
	
КонецПроцедуры


&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	СтруктураНастройки = Новый Структура();
	// --- 
	СтруктураНастройки.Вставить("Показатели",Показатели);
	СтруктураНастройки.Вставить("Группировки",Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВариантФормирования",ВариантФормирования);
	СтруктураНастройки.Вставить("ПорядокОтражения",ПорядокОтражения);
	СтруктураНастройки.Вставить("ОбъединитьГруппировки", ОбъединитьГруппировки);

	// --- 
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _УправлениеЭлементамиФормы()
	// --- 

		// --- 
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
	
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();
	
	СформироватьПриОткрытии = Ложь;
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВариантПериодаОтчета", 		ВариантПериодаОтчета);
	Настройки.Вставить("НачалоПериода", 			НачалоПериода);
	Настройки.Вставить("КонецПериода",				КонецПериода);
	
	Настройки.Вставить("ВариантФормирования", 		ВариантФормирования);
	Настройки.Вставить("ПорядокОтражения", 			ПорядокОтражения);
	Настройки.Вставить("ВыводитьРасходыДоходы",  	ВыводитьРасходыДоходы);
	Настройки.Вставить("ВерсияБюджета", 			ВерсияБюджета);
	Настройки.Вставить("Организация", 				Организация);
	Настройки.Вставить("Показатели",  				Показатели);
	Настройки.Вставить("Разделы", 					Разделы);
	Настройки.Вставить("Группировки", 				Группировки.Выгрузить());
	Настройки.Вставить("ДатаОпределенияПрибыли", 	ДатаОпределенияПрибыли);
	Настройки.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты",  ИсключатьВнутрихолдинговыеВзаиморасчеты);
	Настройки.Вставить("ОбъединитьГруппировки",  	ОбъединитьГруппировки);
	
	Возврат ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00"		, "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59"		, "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "План"			, "План", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Факт"			, "Факт", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Отклонение"	, "Отклонение", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Расходы"		, "Расходы", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Доходы"		, "Доходы", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Прибыль"		, "Прибыль", ГоризонтальноеПоложение.Центр);	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма"		, "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС"			, "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего"		, "Всего", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого"		, "ИТОГО:");	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "ВРУ"			, Строка(Константы.ВалютаРегламентированногоУчета.Получить()));	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Реализация за период");
	//УправлениеКолонтитулами
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	Если Скрыть Тогда
		
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
		
	Иначе
		
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
			
		Иначе
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПолучитьСписокДоступныхГруппировок()
	// --- 
	
	//Возврат(_сф.сп_ОтобратьПоПометке(СписокГруппировок,Ложь));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ГруппировкиПередУдалением(Элемент, Отказ)
	
	//УдаляемаяСтрока = Группировки.НайтиПоИдентификатору(Элементы.Группировки.ТекущаяСтрока);
	//Стр = СписокГруппировок.НайтиПоЗначению(УдаляемаяСтрока.ИмяПоля);
	//Если Стр <> Неопределено Тогда
	//	Стр.Пометка = Ложь;	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		//СписокПолей.Добавить("Регистратор");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПолучитьСписокПолейДляОтбораПоИнтервалу() Экспорт 

	сз = Новый СписокЗначений;
	сз.Добавить("Реквизит.ДатаСделкиФ", "Дата грузоперевозки", , БиблиотекаКартинок.CW_Грузоперевозки);
	сз.Добавить("Реквизит.ДатаЗакрытия", "Дата блокировки", , БиблиотекаКартинок.CW_Грузоперевозки);
			
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка,
		|	CW_ПараметрыГрузоперевозок.Наименование,
		|	CW_ПараметрыГрузоперевозок.ТипЗначения,
		|	CW_ПараметрыГрузоперевозок.Код
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	НЕ CW_ПараметрыГрузоперевозок.ЭтоГруппа"
	);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Пока выб.Следующий() Цикл
		Если выб.ТипЗначения.СодержитТип(Тип("Дата")) Тогда // выб.ТипЗначения это ОписаниеТипов, а не тип
			сз.Добавить(выб.Код,"(П) "+выб.Наименование, , БиблиотекаКартинок.ДиаграммаГанта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат сз;

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		Период = ОтветПериод;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьБазовуюВерсиюБюджета()
	
	Возврат ?(ЗначениеЗаполнено(Константы.CW_БазоваяВерсияБюджета.Получить()), Константы.CW_БазоваяВерсияБюджета.Получить(), Справочники.CW_ВерсииБюджетов.Основная);
	
КонецФункции

&НаКлиенте
Процедура ДатаОпределенияПрибылиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
		ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
	КонецЕсли;		
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("ВариантПериодаОтчета",ВариантПериодаОтчета);
	Настройки.ДополнительныеСвойства.Вставить("Показатели",Показатели);
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("НачалоПериода",НачалоПериода);
	Настройки.ДополнительныеСвойства.Вставить("КонецПериода",КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("ПорядокОтражения",ПорядокОтражения);
	Настройки.ДополнительныеСвойства.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты",ИсключатьВнутрихолдинговыеВзаиморасчеты);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
		
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Очистить();
	Настройки.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РазделыПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьМассивГрузоперевозокНаСервере()
	
	МассивГрузоперевозок = Новый Массив;
	
	Расшифровка = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	Для Каждого ЭлементРасшифровки из Расшифровка.Элементы Цикл  
		
		Если ТипЗнч(ЭлементРасшифровки) <> тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЭлементРасшифровки.ОсновноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля();  
		Для Каждого ПолеРасшифровки из ПоляРасшифровки Цикл
			Если ПолеРасшифровки.Поле = "Грузоперевозка"	Тогда
				Если МассивГрузоперевозок.Найти(ПолеРасшифровки.Значение) = Неопределено Тогда
					МассивГрузоперевозок.Добавить(ПолеРасшифровки.Значение);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат МассивГрузоперевозок;
	
КонецФункции

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции

&НаКлиенте
Процедура СкопироватьГрузоперевозкиВБуферОбмена(Команда)
	
	МассивГрузоперевозок = ПолучитьМассивГрузоперевозокНаСервере();
	Если МассивГрузоперевозок.Количество() = 0 Тогда
		  ПоказатьПредупреждение(, "В отчете отсутствует группировка ""Грузоперевозка"". Копирование в буфер не возможно!");
		Возврат;
	КонецЕсли;
	
	СкопироватьНаСервере(МассивГрузоперевозок);
	
	CW_РаботаСБуферомОбменаКлиент.ОповеститьОКопированииСтрокВБуферОбмена(ЭтаФорма, МассивГрузоперевозок.Количество());

КонецПроцедуры 

&НаСервере
Процедура СкопироватьНаСервере(ПараметрКоманды) 
	
	CW_РаботаСБуферомОбмена.СкопироватьВБуферОбмена(ПараметрКоманды, ПараметрКоманды[0].Метаданные().Имя);
	
КонецПроцедуры
//Работа с буфером обмена  

//БухгалтерскиеОтчетыКлиент
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры
//---БухгалтерскиеОтчетыКлиент
